[
    {
        "company": "SALT",
        "job_title_id": 19,
        "location": "GREATER DENVER AREA",
        "description": "Join the saltiest team around in our heroic effort to reinvent finance for the blockchain era. In the heart of the Mile High City, You will work alongside a small team of talented and very passionate individuals to help construct a bleeding-edge, mission-critical, revolutionary technology that will be used by crypto holders all over the world.",
        "status": ""
    },
    {
        "company": "TRAVELERS HAVEN",
        "job_title_id": 10,
        "location": "GREATER DENVER AREA",
        "status": ""
    },
    {
        "company": "T-MOBILE HOME + ENTERTAINMENT",
        "job_title_id": 20,
        "location": "GREATER DENVER AREA",
        "description": "Job Description:\nPrincipal This position will be a member of the team responsible for the design, development and implementation of the video delivery platform. This position will participate in systems design, development and implementation of the video distribution and delivery.\n \nResponsibilities:\n\n",
        "status": ""
    },
    {
        "company": "BLUEMODUS",
        "job_title_id": 21,
        "location": "GREATER DENVER AREA",
        "description": "We're looking for a Senior Web Developer, who is self-starter, can think on his/her feet, play well with others, and do great work in a fast paced, agency environment and has experience developing for content management platforms such as Kentico, Sitecore and/or Sitefinity.\n ",
        "status": ""
    },
    {
        "company": "BLUEMODUS",
        "job_title_id": 22,
        "location": "GREATER DENVER AREA",
        "description": "BlueModus is looking for a talented technical professional to lead a group of .Net developers, could it be you?",
        "status": ""
    },
    {
        "company": "TRAININGPEAKS (A PEAKSWARE COMPANY)",
        "job_title_id": 10,
        "location": "GREATER BOULDER AREA",
        "description": "Who We Are",
        "status": ""
    },
    {
        "company": "BLINKER",
        "job_title_id": 2,
        "location": "GREATER DENVER AREA",
        "description": "Why work with us:",
        "status": ""
    },
    {
        "company": "RECURLY",
        "job_title_id": 12,
        "location": "GREATER BOULDER AREA",
        "description": "We are looking for an energetic and dynamic engineering team lead to help build our core payments infrastructure and evolve our payment gateway integrations. You will help lead an existing team of experienced and ego-free software engineers to help ensure the continued success of our company and our engineering team during our rapid and international growth.",
        "status": ""
    },
    {
        "company": "HEALTHGRADES",
        "job_title_id": 2,
        "location": "GREATER DENVER AREA",
        "description": "As a Software Engineer within our data engineering group, you will collaborate with cross-functional database and product development teams as we accomplish building a scalable and reliable infrastructure for our leading-edge Enterprise Data Platform.",
        "status": ""
    },
    {
        "company": "PERCOLATE",
        "job_title_id": 4,
        "location": "GREATER DENVER AREA",
        "description": "Since 2011, Percolate has addressed the enormous challenges presented by enterprise marketing operations, and has been foundational in the development of a new categories of marketing technology - Content Marketing Platforms (CMP) and Marketing Resource Management (MRM).",
        "status": ""
    },
    {
        "company": "ROBUSTWEALTH",
        "job_title_id": 10,
        "location": "GREATER DENVER AREA",
        "description": "RobustWealth is a fast-paced wealth management company that is changing the way investment advisors, banks, and enterprises are doing business. Our platform seamlessly integrates an array of previously modular features into one suite to optimize investing and wealth management practices. The technology suite includes: automated rebalancing, billing/remittance, document vaults, electronic account opening, institutional quality goals -&- risk based investment portfolios, and the open architecture use of investment options. Check out the positive press we've received in Financial Planning Magazine, Wealth Management Magazine, and the Philadelphia Inquirer to learn more!",
        "status": ""
    },
    {
        "company": "ROBUSTWEALTH",
        "job_title_id": 10,
        "location": "GREATER DENVER AREA",
        "description": "RobustWealth is a fast paced wealth management company that is changing the way investment advisors, banks, and enterprises are doing business. Our platform seamlessly integrates an array of previously modular features into one suite to optimize investing and wealth management practices. The technology suite includes: automated rebalancing, billing/remittance, document vaults, electronic account opening, institutional quality goals -&- risk based investment portfolios, and the open architecture use of investment options. Check out the positive press we've received in Financial Planning Magazine, Wealth Management Magazine, and the Philadelphia Inquirer to learn more!",
        "status": ""
    },
    {
        "company": "JUMPCLOUD",
        "job_title_id": 10,
        "location": "GREATER BOULDER AREA",
        "status": ""
    },
    {
        "company": "HAVENLY",
        "job_title_id": 4,
        "location": "GREATER DENVER AREA",
        "description": "Havenly is interior design for real people. We're a funded tech startup in Denver, and we believe everyone deserves a beautiful home they love. As the Lead Frontend Engineer at Havenly, you will lead a team of engineers to ship delightful experiences to every customer and potential customer to visit Havenly’s site. We expect that you will be both mentor and team leader for your engineers. This means that you will help with technical decisions, coach the engineers reporting to you, and partner with stakeholders cross-functionally - and you will definitely be writing code. On a typical day, you can expect to to coach engineers to level up their technical and soft skills, to plan and scope future projects, and to help fix a small bug or guide a new feature development.",
        "status": ""
    },
    {
        "company": "OMBUD",
        "job_title_id": 9,
        "location": "GREATER DENVER AREA",
        "description": "Ombud is looking for a Platform Developer who can make an immediate impact building scalable, distributed systems that empower organizations to make intelligent decisions. You will work in the heart of downtown Denver with a small, agile team of developers to deliver new features and improvements to our product. We are looking for experienced and passionate developers who want to make a difference while collaborating in an entrepreneurial, startup environment that prioritizes our team and user community.",
        "status": ""
    },
    {
        "company": "BLUE MOON DIGITAL, INC.",
        "job_title_id": 13,
        "location": "GREATER DENVER AREA",
        "description": "Working as a member of Blue Moon Digital, Inc.’s BI Team, the ETL Developer & Data Modeler will be focused on the implementation of fault tolerant, highly scalable solutions. The successful candidate will have a minimum of 5 years working hands-on with data. This individual will join an enthusiastic, fast-paced and dynamic team at Blue Moon Digital. A successful candidate will have demonstrated sustained exceptional performance, innovation, creativity, insight, and good judgment. They will work with stakeholders, Business Analysts, and other resources to refine requirements, create or modify technical programs, and execute data models.",
        "status": ""
    },
    {
        "company": "GOSPOTCHECK",
        "job_title_id": 19,
        "location": "GREATER DENVER AREA",
        "description": "What You’ll Do",
        "status": ""
    },
    {
        "company": "THOUGHTWORKS",
        "job_title_id": 19,
        "location": "GREATER DENVER AREA",
        "description": "Our developers have been contributing code to major organizations and open source projects for over 25 years now. They’ve also been writing books, speaking at conferences, and helping push software development forward -- changing companies and even industries along the way.",
        "status": ""
    },
    {
        "company": "THOUGHTWORKS",
        "job_title_id": 10,
        "location": "GREATER DENVER AREA",
        "description": "Can you spot poorly written code?",
        "status": ""
    },
    {
        "company": "THRIVEHIVE",
        "job_title_id": 2,
        "location": "GREATER DENVER AREA",
        "description": "ThriveHive is seeking an engineer to help us design and build rock solid software, including support for killer mobile and web applications.  As that engineer, you must have a passion for and a bit of history building great software and working with other talented folks on tough problems.",
        "status": ""
    },
    {
        "company": "ANDCULTURE",
        "job_title_id": 4,
        "location": "GREATER DENVER AREA",
        "description": "Our Software Engineers go through the full software development lifecycle. They participate in the design, testing and execution of the code that is developed. Our Software Engineers are able to help gather user requirements, define system functionality and write code in various languages.",
        "status": ""
    },
    {
        "company": "BRANDZOOKA",
        "job_title_id": 2,
        "location": "GREATER BOULDER AREA",
        "description": "Summary:",
        "status": ""
    },
    {
        "company": "DIGITALGLOBE",
        "job_title_id": 2,
        "location": "GREATER DENVER AREA",
        "description": " ",
        "status": ""
    }
]