[
    {
        "company": "DHI GROUP, INC.",
        "job_title": "Application Architect",
        "location": "GREATER DENVER AREA",
        "description": "General Purpose,The Application Architect is responsible for balancing the concerns of implementation, requirements, and long-term needs in delivering cloud-based solutions using AWS. This individual leads and supports the architecture and design efforts of multiple development teams. Core activities of the role include determining non-functional needs, modeling, prototyping and evaluating architectural solutions, and negotiating design trade-offs with stakeholders and engineers.,The Application Architect works closely with DHI technical leadership, Product Managers, and Director of Architecture to define the vision and goals of DHI services and application architecture and assists in translating that vision into actionable projects on the roadmap. This position focuses on the architecture of our Pay for Performance product, which aims to deliver quality candidates to employers on time and budget. The architect will collaborate with campaign management, job ingestion, job search, yield optimization and marketplace optimization teams. As well as contributing to other high priority product initiatives. The Application Architect acts as a resource and mentor for other technical personnel on a daily basis and assists in a hands-on capacity when needed.,Essential Duties/Responsibilities,Job Qualifications",
        "status": ""
    },
    {
        "company": "TRAVELERS HAVEN",
        "job_title": "Software Engineer",
        "location": "GREATER DENVER AREA",
        "description": "Travelers Haven seeks a software engineer with strong abstract problem-solving abilities to join our Hotel Engine group ( https://www.hotelengine.com ). You will work directly with the executive team and the employees using our software to help shape the future of our company. Our team is small but focused on shipping quality product. The ideal candidate for this position is willing and able to work full-stack and do CSS/JS as needed but gravitates more towards the back-end systems side.",
        "status": ""
    },
    {
        "company": "WOWZA MEDIA SYSTEMS",
        "job_title": "Software Engineer",
        "location": "GREATER DENVER AREA",
        "description": "Are you ready to start your career in an exciting, growing field? Wowza Media Systems, a leader in the live streaming and Video on Demand industry is looking to add a sharp, energetic, inquisitive self-starters to their team of amazing Engineers. Wowza has an awesome culture, cool products and awesome array of customers around the globe. If you are looking for a collaborative environment where you can learn and develop your technical skills, we want to hear from you!,You will be learning about our products and services including,We'd like you to have,About Wowza, ,We are committed to shaping the streaming industry and lead the way with products and services that both simplify streaming, and provide tools for advanced users to build their own customized solutions. By staying true to our focus on customer success we continue to redefine our industry and impact the world. , ,What we love about working for Wowza ,This is a great opportunity to build an exciting and rewarding career with an innovative, successful emerging technology company that is passionate about our customers and has a track record of delivering results.  ",
        "status": ""
    },
    {
        "company": "TALENTREEF",
        "job_title": "QA Automation Engineer",
        "location": "GREATER DENVER AREA",
        "description": "Position Summary,talentReef needs a QA Automation Engineer and be responsible for creating and maintaining automation testing scripts and frameworks to provide increased test coverage for multiple applications and services.  The ideal candidate should be knowledgeable and proficient in Speed/Load, API and UI testing frameworks to ensure quality, increase deployment and delivery of features, and reporting of test suite results., ,Responsibilities, ,Requirements, ,Preferred Qualifications, , , , , ",
        "status": ""
    },
    {
        "company": "ALTERYX, INC.",
        "job_title": "Software Engineer",
        "location": "GREATER DENVER AREA",
        "description": "",
        "status": ""
    },
    {
        "company": "SLALOM",
        "job_title": "Solution Principal",
        "location": "GREATER DENVER AREA",
        "description": "Slalom Build is a highly-scalable, high-velocity Build as a Service firm. We work with clients to close the distance between dream and reality, imagined possibility and technical realization.  , ,We do this by blending design, product engineering, analytics, and automation to build the modern technology products of tomorrow.  , ,Nearly 1000 builders strong in seven Build Centers across North America, Slalom Build leverages a foundation of innovation inherited from Slalom Consulting. We’re intensely proud to partner with future-focused clients committed to disrupting their industries. , ,About Slalom,Founded in 2001 and headquartered in Seattle, WA, Slalom has organically grown to over 6,000 employees. We were named one of Fortune’s 100 Best Companies to Work For in 2017 and are regularly recognized by our employees as a best place to work. You can find us in 27 cities across the U.S., U.K., and Canada., ,Job Title,Solution Principal – Digital Experience Management - Sitecore,Motivated individual with a “get it done” mentality that has a passion for helping organizations solve complex business and technology problems. This person will build and deliver intelligent and robust solutions for Slalom Consulting’s clients as a Digital Experience Management Solution Principal. The individual in this role will lead technical requirements sessions, act as a liaison between clients and Slalom’s internal development staff, architect and document solutions, and develop interfaces between Sitecore and other systems. You will have a minimum of five years of meaningful work experience and be adept at handling client expectations and maintaining scope according to defined requirements. ,For this particular role, the ideal candidate is an authority in the Sitecore Experience Platform, and is comfortable leading and mentoring a team of developers. , ,Responsibilities:,• Translate business requirements into well-architected solutions that best leverage the Sitecore platform,• Lead technical design sessions; architect technical solutions that are aligned with client business objectives,• Lead developers through the process to Design, Develop, and Build innovative marketing technology solutions ,• Lead the technical delivery of custom development, integrations, and data migration elements of a Sitecore implementation,• Develop custom solutions and interfaces using Sitecore,• Develop integrations between Sitecore and other platforms, development frameworks, modern web technologies etc.,• Handle technical scopes and client expectations,• Provide hands-on, expert-level technical assistance to developers,• Design and lead the execution of test plans to ensure a quality solution is delivered,• Demonstrate technical thought leadership,• Conduct code reviews for ongoing projects to ensure that code quality is at the highest level possible and appropriate design patterns are being used,• Be a credible domain authority to clients and partners on sales cycles and marketing events,• Provide detailed estimates,• Train and mentor junior technical resources; own responsibility for ongoing technical development of technical resources on projects.,• Collect and evangelize standard methodologies for development and client delivery among teams, both within and outside of your organization.,• Travel Requirements: Willingness to travel up to 50%,• Serve as a people manager for architects and developers,• Interview potential candidates as needed and as time permits,• Meet with and evaluate client business challenges and help them evaluate and arrive at the best-fit technology solutions,• Collaborate with delivery managers to assess work effort for a solution,• Work with highly skilled Slalom team members to build and develop ground breaking solutions,• Assist with estimating work efforts required for each phase of a project,• Work on POC projects with ground breaking technologies, ,Qualifications:,• Bachelor’s degree in a technical discipline or equivalent,• Ability to design and optimize business processes and integrate business processes across disparate systems,• 7+ years of Web Content Management System experience,• Minimum of 3 years of Sitecore platform experience (5+ years preferred),• Minimum of 5 years of .NET experience,• Understanding of object-oriented design principles,• Solid background in design and development of enterprise systems as part of a complete software product lifecycle,• Familiarity with agile software delivery methodologies such as Scrum,• Excellent client-facing written and oral communications skills,• Sitecore certified developer on version 8 or later (vesion 9 preferred),• Experience with Agile project management methodologies,• Experience leading development teams through everyday project tasks, and collaborating across multiple functional/technical teams to deliver a project,• Experience leading and mentoring team members as direct reports,• Demonstrable experience with project management (milestone, status, progress responsibilities),• Strong customer-facing consulting skills, ,Preferred Skills,• Deep functional knowledge of Sales and Support business processes,• Ability to not only solution but help out with hands-on development,• Knowledge of Sitecore Experience Platform features,• Knowledge and experience with the Sitecore Experience Accelerator (SXA) product,• Understanding of Sitecore Helix development principles,• Front-end development experience using HTML5/CSS3, jQuery or other major JavaScript libraries,• Senior Architecture experience in .NET stack: such as C#, ASP.NET (Web Forms and MVC), .NET Core, ,Slalom Is An Equal Opportunity Employer And All Qualified Applicants Will Receive Consideration For Employment Without Regard To Race, Color, Religion, Sex, National Origin, Disability Status, Protected Veteran Status, Or Any Other Characteristic Protected By Law.",
        "status": ""
    },
    {
        "company": "BLUETENT",
        "job_title": "PHP Developer Tier III",
        "location": "WESTERN COLORADO",
        "description": "Who is Bluetent?:,Located in the heart of the Rocky Mountains – we are a team that loves to play hard and work harder. As an Outside Magazine Best Place to Work 6 years running, we believe success is powered by our team’s happiness. We’re just a talented bunch of innovative developers, creative artists, social experts, email ninjas, search enthusiasts, anglers, alpine skiers, trail runners, environmentalists, who genuinely care about our client’s success.,Our vision is to be the premier digital agency in the hospitality industry by driving quality conversions and creating digital experiences that inspire and motivate travelers to place. Our mission is to create value and deliver measurable results to our clients through innovation and quality in the digital space. We focus on sustainable growth driven by the success of our clients, the strength of our team and a culture that encourages excellence in both our professional and personal lives.,About this position:,Tier 3 PHP developers are responsible for architecting and enforcing the development approach of individual projects.  Developers in this role will be experienced in all aspects of LAMP stack development, including basic DevOps and Unit testing. Tier 3 developers will often participate in direct customer communication to better understand the expected outcomes, and then translate those solutions to team members (both technical and non-technical). These developers will often be responsible for direct implementation of solutions, but will understand when to delegate appropriate tasks to members of their team.,In this role, you will:,Architect and Implement complex features on individual applications.,Providing  direct consultation to sales, project managers and developers.,Providing a feedback loop with senior engineering resources as well as development operations to improve overall workflows and developer experience.,Acts as a backend engineering lead on most projects they are assigned.,Is an active participant in daily team standups.,Provides mentorship and guidance to junior team members.,Contributes to developer huddles as often as reasonably possible.,The skills/qualifications we are looking for are:,Minimum 5-7 years experience,Demonstrable PHP programming experience.,Demonstrable unit testing experience.,Deep experience with *Nix based systems, including the ability to accurately report, or resolve some systems based challenges.,Experience creating scalable mySQL database schemas.,Experience with PHP based CMS systems.,Excellent communication skills.,Experience with Composer., , ,Please provide a resume and a link to any public repositories or gist files that demonstrate relevant experience or projects you are proud of when applying.",
        "status": ""
    },
    {
        "company": "BLUETENT",
        "job_title": "PHP Developer Tier II",
        "location": "WESTERN COLORADO",
        "description": "Who is Bluetent?:,Located in the heart of the Rocky Mountains – we are a team that loves to play hard and work harder. As an Outside Magazine Best Place to Work 6 years running, we believe success is powered by our team’s happiness. We’re just a talented bunch of innovative developers, creative artists, social experts, email ninjas, search enthusiasts, anglers, alpine skiers, trail runners, environmentalists, who genuinely care about our client’s success.,Our vision is to be the premier digital agency in the hospitality industry by driving quality conversions and creating digital experiences that inspire and motivate travelers to place. Our mission is to create value and deliver measurable results to our clients through innovation and quality in the digital space. We focus on sustainable growth driven by the success of our clients, the strength of our team and a culture that encourages excellence in both our professional and personal lives.,About this position:,Tier 2 PHP developers are responsible for helping guide the direction and implementation of individual projects.  Developers in this role will be experienced in most of aspects of LAMP stack development, and will be comfortable recommending approaches to solving complex problems. Tier 2 developers will occasionally participate in direct customer communication to better understand the expected outcome of business problems. This role requires knowledge of the software development life cycle, and the ability communicate ideas to both technical and non-technical resources.,In this role, you will:,Implementing complex features on individual applications.,Providing consultation to project managers and developers.,Providing a feedback loop with senior engineering resources as well as development operations to improve overall workflows and developer experience.,Acts as an engineering lead on smaller projects.,Is an active participant in daily team standups.,The skills/qualifications we are looking for are:,Minimum 3-5 years of LAMP stack experience,Demonstrable PHP programming experience.,Comfort working in a team of developers utilizing VCS systems.,Some experience with *Nix based systems, and the ability to confidently/accurately report (not necessarily fully diagnose/resolve) systems based issues.,Experience working with mySQL databases (Raw mySQL or DBAL).,Experience with PHP based CMS systems.,Excellent communication skills.,Awareness of unit testing/devops.,Please provide a resume and a link to any public repositories or gist files that demonstrate relevant experience or projects you are proud of when applying.",
        "status": ""
    },
    {
        "company": "MARIJUANA BUSINESS DAILY",
        "job_title": "Front End Developer",
        "location": "GREATER DENVER AREA",
        "description": "Front-End Web Developer,Marijuana Business Daily (MJBizDaily), since 2011 the best-known producer of B2B news and trade shows serving executives and major investors in America's $8 billion cannabis industry, is seeking a talented front-end web developer to create and maintain all of our web properties. In this role you will collaborate with our fun and talented team to take on web projects and drive them to a successful conclusion.,You'll be based in our Denver office and receive a competitive salary, paid time off, 401(k) and health benefits. As seen in Inc. Magazine, Forbes and the Wall Street Journal, we are a highly professional, award-winning, fast-growing company serving an equally fast-growing industry. ,Day to day job description:, ,Bonus skill sets and experience:,\nWhat you’ll get from us:,\nMarijuana Business Daily is a division of Anne Holland Ventures Inc. Anne Holland Ventures Inc. is a woman owned, Inc. 500 business and an equal opportunity employer.,No relocation assistance provided for this role.  Marijuana Business Daily is a division of Anne Holland Ventures Inc. Should you be offered a position, please expect to complete a background/reference check. Anne Holland Ventures Inc is woman owned and an equal opportunity employer.",
        "status": ""
    },
    {
        "company": "CONVERCENT",
        "job_title": "Software Engineer",
        "location": "GREATER DENVER AREA",
        "description": "The Software Engineer will be responsible for every aspect of the SDLC for new and existing applications features. The ideal candidate would be a self-starter and results oriented engineer, willing to work in an entrepreneurial, start-up environment. This role requires an individual to possess high desire to be creative, empowered, and manage their own destiny. This position reports to the VP, Engineering.,Responsibilities include, but are not limited to: ,• Work shoulder to shoulder with creative, intelligent, fun loving engineers on challenging problems.,• Collaborate in small cross-functional teams to materialize high quality solutions.,• Immerse and participate in a self-organized, self-driven, accountable Agile engineering team.,• Implement code patterns using modern Object Oriented engineering practices.,• Work with and enhance existing architecture while participating in greenfield application development.,• Build user interfaces with a focus on a streamlined experiences for customers with needs from small business to enterprise.,• Participate in code and design reviews to ensure standards are met across development and design.,Desired Skills/ Experience: ,• 3+ years developing in C# and using OOP development practices.,• 3+ years working with scalable web-based applications and infrastructures.,• 2+ years working with SQL Databases or Document Stores,• 1+ years working with RESTful web services.,• 1+ years working with Web patterns: Web API / OWIN / MVC 5+ / MVW / MVVM,• Engage in Unit Testing and Integration Testing,• Strong understanding of Agile development methodology and prior Agile team experience.,• Strong knowledge of client side development models using JavaScript or TypeScript.,Stuff We’d Love You to Know or be Excited to Learn: ,• Mocking and Performance testing.,• Front-End automation experience.,• .Net Core / Asp.Net Core.,• Microservice experience.,• React / Angular 2+,• CI / CD experience.,• Mentoring and Leadership.,• Docker / Kubernetes / Service Fabric / other containers and orchestration frameworks.,About Convercent:,Robust. Agile. Collaborative. And you should see our software. Bringing the transformative power of the cloud to the compliance and ethics industry, Convercent's award-winning SaaS solution empowers our customers to be more effective and efficient in managing their compliance efforts and mitigating risk. With an inclination towards innovation, Convercent is helping our customers raise the standard--and expectations--for how companies safeguard their financial and reputational health. ,Convercent is an equal opportunity employer and all qualified applicants will be considered for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.",
        "status": ""
    },
    {
        "company": "IBOTTA",
        "job_title": "Platform Engineer",
        "location": "GREATER DENVER AREA",
        "description": "Ibotta is looking for a Platform Engineer to come build something great with us. As part of the engineering team, you will work on the platform that powers our app that is used by millions of consumers. We're looking for a self-motivated engineer who has a real passion for building and scaling infrastructure using technologies such as Ruby on Rails, Spark with Scala, AWS Lambda with JavaScript, Redis, DynamoDB, and machine learning. Every engineer has input into our product process and will have a real impact as part of a small, nimble team.,Here is what you’ll be doing:,Here is what we’re looking for:,Nice to have:,About Us:,Headquartered in Denver, CO, Ibotta (“I bought a...“) is transforming the shopping experience by making it easy for consumers to earn cash back on everyday purchases through a single smartphone app. The company partners with leading brands and retailers to offer rebates on groceries, electronics, clothing, gifts, home and office supplies, restaurant dining, and more. Ibotta is the premier destination for rewarded shopping on mobile and has paid out $340 million in cash back to its users. Launched in 2012, Ibotta has 28 million downloads and is one of the five most frequently used shopping apps in the United States.,To learn more about what our Tech teams are doing day to day, visit Building Ibotta on Medium.com.,Additional Details:",
        "status": ""
    },
    {
        "company": "FOUR WINDS INTERACTIVE",
        "job_title": "Front End Developer",
        "location": "GREATER DENVER AREA",
        "description": "With 6,000+ clients and over 500,000 screens deployed, FWI’s software platform is driving Visual Communications to millions of people every day, all over the world. We are a values-driven organization that encourages our employees to bring their authentic self to work every day and empowers everyone to make a tangible impact on our products, clients and culture. Our employees are passionate about their craft, but they are also parents, skiers, comedians, runners, animal lovers, foodies and phenomenal human beings who appreciate our dedication to providing a healthy work/life balance., ,We’re proud to be one of Built In Colorado’s top digital tech companies. At FWI, our culture is important to us. We are a diverse team of talented, passionate people who want to make a difference, but don’t take ourselves too seriously. If our core values speak to you, we want to meet you:,Four Winds Interactive seeks a Software Developer to work with the Product development team. This position will serve as the UI champion for our web-based products. The Software Developer will work with development staff, other internal users and take customer feedback to design and develop UI for all FWI web products. ,Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status",
        "status": ""
    },
    {
        "company": "PAYFONE",
        "job_title": "Senior Software Engineer",
        "location": "GREATER DENVER AREA",
        "description": "Help shape the future of how people experience the digital world. You’ll be at the forefront of innovating and inventing how industries, from financial to enterprise, use mobile data to curate solutions for mobile identity authentication while, of course, enjoying a cold brew in the office, if that’s your style. We are actively looking to add exceptional people to our team who align with how we envision ourselves culturally and professionally. As a lens to how outsiders see Payfone, you will represent a team of people who love what they do and who they work with.,Position Summary\nThe Senior Software Engineer will be part of a small team designing and developing the infrastructure powering the next generation of mobile identity certainty. Leveraging your knowledge and passion for excellence you will deliver well-thought-out software solutions as part of a fault-tolerant, scalable platform utilizing a variety of cutting edge technologies. This is a hands-on role where you will need to demonstrate the skills, experience, and confidence to work with senior engineering and product management team members to deliver solutions that will delight our customers.,What You Are Accountable For,As a member of the Software Development team, the Senior Developer is expected to:,Education & Experience,About Payfone ,In today's world, it takes a few bad actors to force businesses to treat all customers with suspicion. This leads to customer and employee frustration, increased operating costs and reduced revenue. Payfone delivers a seamless non-intrusive verification using your mobile phone’s inherent identity to provide persistent protection for businesses and their customers.\nPayfone removes customer friction and drives user engagement with Instant Trust to enable the best possible experience while lowering the risk of loss due to friction and fraud. The company is backed by leading venture firms, financial institutions and Mobile Network Operators and is based in New York. Additional information is available at www.payfone.com.This position description should not be considered the final description of the position. It should be assumed that we would, to some extent, structure responsibilities in accordance with the successful candidate’s capabilities and changing business conditions.,Payfone is an equal opportunity employer committed to providing equal employment opportunity for all people regardless of race, color, religion, gender or sexual orientation, age, marital status, national origin, citizenship status, disability, veteran status or other personal characteristics.",
        "status": ""
    },
    {
        "company": "ENVYSION",
        "job_title": "Software Developer",
        "location": "GREATER BOULDER AREA",
        "description": "Envysion, a leading provider of video based SaaS technology solutions for retailers, fast casual restaurants and wireless dealers, is seeking an Software Developer.,At Envysion we help companies deliver on their brand promise. Successful brands know their formula: the experience they want their customers to have, the processes they want their employees to follow, and the economics they expect to achieve. Envysion gives them the ability to understand whether they are delivering on this formula. We provide what they need to test, measure, and make needed changes that impact their customers, their operations and their profitability.,Our video intelligence platform gives visibility into every store, every location, every day, from anywhere. We provide the insight into the most important events so real-time changes can be made. ENVYSION INSIGHTS brings operational, financial and employee metrics together with video and sophisticated analytics to transform them into actionable insights delivered to decision makers across the organization - no matter where they are - via an Android app, iOS app and a web platform.,In order to continuously innovate and deliver our world-class Android app we seek to add an innovative experienced Android Engineer who is excited by the prospect of upgrading and coding the entire android app of our product.,You will work loosely with a small, agile team developing highly scalable applications. You will be responsible for the Android development and will be able to work closely with the engineers working on the web platform as well as the APIs. This is an opportunity to work with real-time, event driven video players in an Android app.,Our engineers are actively delivering high quality code, while continuously improving the development practice, product, and team.  We don’t take ourselves too seriously and we are able to admit when there’s a better way to do something. ,If this sounds like the right role for you, we’d love to hear from you!,The Software Developer will work on the Envysion Appliance team using node.js, c++, and linux utilities to create an appliance that records and captures video and event data from physical retail locations.  In this role, you will be part of an agile development team, embrace a devops mindset, focus on customer value, interact with customer facing staff and occasionally technical customer contacts. ,The skills and experience we need:,The skills and experience we need:,Soft skills that will help you be successful in the role,Envysion is an equal opportunity employer. ",
        "status": ""
    },
    {
        "company": "DENVER PUBLIC LIBRARY",
        "job_title": "Back End Developer",
        "location": "GREATER DENVER AREA",
        "description": "Work downtown at the Central Library contributing to the development and maintenance of Denver Public Library's evolving range of digital services, including its websites. Use strong programming and application architecture skills as a backend developer to create digital experiences that help people be better people. Play a critical role in helping the Digital User Experience team build world-class digital services for a world-class library. Foster effective communication with a variety of end users in order to build customer-centric digital experiences. ,Curiosity. Focused energy. A sincere desire to improve our community. Skill in developing applications using PHP, MySQL and Drupal. Experience creating and maintaining custom Drupal modules. Experience integrating external data sources into Drupal web applications using APIs. Knowledge of Javascript, CSS, Sass, HTML5, JSON and/or other XML standards. Experience using software versioning tools such as Git or Bitbucket. Experience working on teams using Agile methodologies like Scrum or Kanban. Ability to contribute to a team focused on turning UX insights into remarkable experiences. Ability to take risks, strive for excellence and learn iteratively. Ability to pass a background check after the offer to hire has been made.\n\nTwo years of professional experience working with interactive/web development teams.\n\nA Bachelor's Degree in information systems, computer science, or a related field, or equivalent education and work experience.\n\nExperience using DevOps tools such as Team Foundation Server, Ansible, or other Continuous Integration systems (preferred, not required).\n\nExperience with Web accessibility standards (preferred, not required).\n\nExperience using Google Analytics (preferred, not required).,The Denver Public Library connects people with information, ideas and experiences to provide enjoyment, enrich lives and strengthen our community. The customer is at the center of all work performed at the Denver Public Library. Denver boasts a diversity of age, background, religion, ethnicity, culture, education, socioeconomic level and lifestyle.\n\nA typical day might include a standup meeting with team members, focused work coding a design change that improves a user flow, walking a group of front-line staff through some prototypes, and collecting, documenting and communicating what you learned.\n\nAlthough the full salary range for this position is provided, offers depend on qualifications and typically do not exceed the midpoint. The City and County of Denver benefit package will be offered.\n\nThe schedule will be determined by the needs of a department that encourages a healthy work-life balance and will rarely ask for hours to be worked outside a normal workday.",
        "status": ""
    },
    {
        "company": "ISONAS INC.",
        "job_title": "Senior Software Engineer",
        "location": "GREATER BOULDER AREA",
        "description": "ISONAS, recently acquired by Allegion, has an immediate opportunity for a Senior Software Engineer to join our Boulder, Colorado team. ISONAS has the right technology at the right time in combination with a highly talented, hard-working team.,If you love fun, technically challenging work and want to take our software to the next level, please apply today! ,What You'll Do,You will play an integral role in development and scalability of our cloud access control platform.  You will be responsible for architecting new features, paying back technical debt, and maintaining existing functionality.  You will also be involved in improving and maintaining our AWS infrastructure. ,Specific responsibilities include:,Design, implement, and document new features\nRearchitect application components for scalability and maintainability\nResearch new technologies and prototype new ideas\nEnsure high testability and quality of the delivered software\nCollaborate with QA and Operations teams to troubleshoot and fix production defects,About You,You love to code, solve problems, and build things. You enjoy working on a small team, are self-driven, efficiently manage your time, and have a strong history of delivering applications across the full spectrum of web development. ,Specific requirements include:,5+ years of development experience in a high-level language (we primarily use Java).\nStrong knowledge of Java, multi-threading, NIO, and socket programming.\nExperience with REST API design.\nExperience with JavaScript, jQuery, and JavaScript frameworks such as React or AngularJS.,Experience designing and maintaining relational and NoSQL databases.",
        "status": ""
    },
    {
        "company": "CANVAS TECHNOLOGY",
        "job_title": "Web Developer",
        "location": "GREATER BOULDER AREA",
        "description": "",
        "status": ""
    },
    {
        "company": "CARBON BLACK, INC.",
        "job_title": "Associate Threat Full Stack Engineer",
        "location": "GREATER BOULDER AREA",
        "description": "This opportunity is open to current Seniors, set to graduate in May 2019.\n\nWe're looking for a Full-stack Web Application Developer who will join a team of developers building and extending internal tooling to support the Carbon Black Predictive Security Cloud. The Predictive Security Cloud is a big data environment that aggregates data from across millions of customer endpoints and provides that data as input to ML, expert systems analytics and streaming prevention, as well as user analysis by threat researchers and intel analysts. These capabilities in turn power all Carbon Black products.,\nWhat You'll Do,\nWhat You'll Bring,\nWhy you should join us,Carbon Black is a leading provider of next-generation endpoint security, leveraging breakthrough prevention technology to instantly see and stop cyberattacks before they execute. With more than 13 million endpoints under management, and more than 4000 customers-including 30 of the Fortune 100-the opportunities are massive and exciting. With 1000+ employees, offices across the world, and the best-of-the best tools for collaboration from anywhere, now is an ideal time to become part of the Cb Team. See where you fit best at Lifeatcb.carbonblack.com.,Carbon Black, Inc. is an EEO/AA employer. Carbon Black is an inclusive employer that believes in workplace equality, supports diversity, creates a welcoming environment, and respects the unique qualities each individual brings to the company.",
        "status": ""
    },
    {
        "company": "WOWZA MEDIA SYSTEMS",
        "job_title": "Senior Software QA Engineer",
        "location": "GREATER DENVER AREA",
        "description": "Wowza is seeking a Senior Software Quality Assurance Engineer to perform testing on our range of Wowza Streaming products, including the following:,•    Wowza Streaming Engine,•    Wowza Streaming Cloud,•    Wowza ClearCaster,•    Wowza GoCoder,•    Wowza Player,•    Wowza Web Systems, ,The ideal candidate will have agile experience testing web services, web applications, mobile and desktop applications, and hardware.  This position and will be located in our Golden office location., ,The person in this role will be responsible for the following:,•    Plan and perform black-box functional and regression testing for Wowza Streaming applications, services, and hardware,•    Work closely with development and product teams to develop, review and maintain test plans and testcases,•    Vocally ensure and evangelize that quality assurance best practices are consistently implemented during development and testing,•    Contribute to the overall test automation efforts by leveraging product expertise,•    Actively identify testing coverage gaps and strive to continuously improve the overall testing approach,•    Provide leadership, ownership, and mentorship on assigned projects, ,Requirements:,•    Must have at least 8 years experience as a Quality Assurance Engineer or Sr. Quality Assurance Engineer,•    Strong working knowledge of operating systems, such as Windows, Linux, and OSX,•    Development and/or scripting experience (e.g. ruby, python, javascript, java),•    Ability to develop and maintain RESTful API tests,•    Comfortable with command-line utilities, such as wget and/or cURL,•    Experience developing and maintaining automation frameworks,•    Understanding of the Agile development lifecycle and iteration-based development,•    Superior communication and problem solving skills along with a desire to continue to learn new technologies,•    Ability to self-motivate and work indendently,•    Proven experience working with remote teams, ,Bonus:,•    Familiar with TestRail use and administration, a web-based test management application,•    Background with Jenkins set-up and administration,•    Fluency with version control sytems, such as git,•    Experience with relational database management systems, such as MySQL,•    Knowledge of Jira administration, an application lifecycle and defect tracking system,•    Understanding of streaming media protocols and codecs,•    Experience with Amazon Web Services, Azure, and Google Cloud,•    Familiar with ffmpeg or other video manipulation software,•    Experience testing applications on iOS and Android devices,•    In-depth knowlege of one or more Linux distributions,•    Background with Docker and/or Kubernetes, ,Who We Are ,Wowza Media Systems (www.wowza.com) creates streaming products and services for delivering video and audio streams to any screen, from desktops to televisions to mobile devices. We have been in business for over ten years, won numerous industry awards, and are driving over 19,000 customers in more than 170 countries. ,We are committed to shaping the streaming industry and lead the way with products and services that both simplify streaming, and provide tools for advanced users to build their own customized solutions. By staying true to our focus on customer success we continue to redefine our industry and impact the world. , ,What we love about working at Wowza: ,This is a great opportunity to build an exciting and rewarding career with an innovative, successful emerging technology company that is passionate about our customers and has a track record of delivering results.  ",
        "status": ""
    },
    {
        "company": "WOWZA MEDIA SYSTEMS",
        "job_title": "QA Software Engineer",
        "location": "GREATER DENVER AREA",
        "description": "Wowza is seeking a Software Quality Assurance Engineer to perform testing on our range of Wowza Streaming products, including the following:,•    Wowza Streaming Engine,•    Wowza Streaming Cloud,•    Wowza ClearCaster,•    Wowza GoCoder,•    Wowza Player,•    Wowza Web Systems, ,The ideal candidate will have agile experience testing web services, web applications, mobile and desktop applications, and hardware.  This position and will be located in our Golden office location., ,The person in this role will be responsible for the following:,•    Plan and perform manual, black-box functional and regression testing for Wowza Streaming applications, services, and hardware,•    Work closely with development and product teams to develop, review and maintain test plans and testcases,•    Ensure that quality assurance best practices are consistently implemented during development and testing,•    Actively identify testing coverage gaps and strive to continuously improve the overall testing approach, ,Requirements:,•    Must have at least 5 years experience as a Quality Assurance Engineer,•    Strong working knowledge of operating systems, such as Windows, Linux, and OSX,•    Understanding of the Agile development lifecycle and iteration-based development,•    Good communication and problem solving skills along with a desire to continue to learn new technologies,•    Ability to self-motivate and work indendently,•    Proven experience working with remote teams, ,Bonus:,•    Familiar with TestRail, a web-based test management application,•    Knowledge of Jira, an application lifecycle and defect tracking system,•    Development and/or scripting experience (e.g. ruby, python, javascript, java),•    Experience developing and maintaining automation frameworks,•    Familiar with API testing,•    Understanding of streaming media protocols and codecs,•    Experience with Amazon Web Services, Azure, and Google Cloud,•    Experience testing applications on iOS and Android devices,•    Comfortable with command-line utilities, such as wget and/or cURL,•    Familiar with ffmpeg, ,Who We Are ,Wowza Media Systems (www.wowza.com) creates streaming products and services for delivering video and audio streams to any screen, from desktops to televisions to mobile devices. We have been in business for over ten years, won numerous industry awards, and are driving over 19,000 customers in more than 170 countries. ,We are committed to shaping the streaming industry and lead the way with products and services that both simplify streaming, and provide tools for advanced users to build their own customized solutions. By staying true to our focus on customer success we continue to redefine our industry and impact the world. , ,What we love about working at Wowza: ,This is a great opportunity to build an exciting and rewarding career with an innovative, successful emerging technology company that is passionate about our customers and has a track record of delivering results.  ",
        "status": ""
    },
    {
        "company": "XERO",
        "job_title": "Senior Software Engineer",
        "location": "GREATER DENVER AREA",
        "description": "Our Purpose: At Xero we are rewiring the small business economy and want millions of small businesses to thrive through beautiful software, advice and connections. We aim to make being a small business more efficient and profitable for small business owners, and more enjoyable too.\nWhy Xero?\nAre you looking for a company that will help grow your career in 2018?\nWe’re looking for Intermediate to Senior Software Engineers with 3 + years experience and a genuine passion for technology to join our Denver office.\nThere aren’t tons of places in Denver where you can work with global teams on cool new technology on an established Global SaaS product, but we’re one of them. We'd like to add people with drive, passion and curiosity to our team. These are phenomenal opportunities to contribute, learn, grow and execute some banging code across our Workpapers product team.\nXero's an inclusive environment, with people who will respect, challenge, support and mentor you to do the best work of your life. Where creativity, innovation and continuous learning are encouraged and celebrated. We value our people and want you to both enjoy and take pride in what you do at work.\nYou're ideal for this role if...\n\nYou're a developer with at least a couple of years experience in the skills we've listed below, come join us writing great code used by over a million people worldwide! You don’t need to be good at everything right now, having some of these core areas of experience is great and we can teach you the rest if you're keen to learn:\n• C# .Net, Node \n• SQL Server, NoSQL \n• Javascript (React, Redux, Webpack, etc) \n• Automated Testing frameworks and methodologies \n• AWS or Azure \nIt's a big plus if you have experience with (or interest in learning more about)\n\n• Continuous delivery and infrastructure as code \n• UX Design and user testing \n• Building and monitoring scalable platforms \n• Distributed systems \n• Working with new technology like Typescript, Rust and .NET Core \nIn our Partner Product team we place a lot of emphasis on collaborative working and delivering exceptional code via modern technical practices (agile, mob programming, rapid deployment pipelines, feature flagging, etc) and by giving our teams autonomy to do their best work their way. If your internal dialogue is \"yeah cool, that sounds awesome\" Read on.\nAs a successful Developer at Xero you’ll\n\n• Be a team player and build great working relationships with other Xeroes \n• Take ownership of your learning \n• Contribute effectively to your team and build great code \n• Give and receive honest constructive feedback \n• Help build a positive work environment where others feel confident and able to deliver great work \n• Continually be open to learning and sharing your knowledge. \n• Have fun !!\nIt's time to introduce yourself\nNow that we’ve caught your attention, it’s time to catch ours. Please apply if you:\nLove doing #beautiful work – contribute to a beautiful experience for our customers.\nShow your passion for the #human side of software development through cultivating a deep understanding of the needs and aspirations small business owners.\nSeek the #challenge of complex technical problems, crazy-smart collaborators and a fast-paced work environment.\n#Champion creative development by bringing a unique point of view while inspiring impeccable work from others.\nTake #ownership by driving meaningful change and delivering results with passion and purpose.\nXero is an Equal Opportunity Employer.",
        "status": ""
    },
    {
        "company": "SLALOM",
        "job_title": "Sr. QE Engineer",
        "location": "GREATER DENVER AREA",
        "description": "Slalom is a purpose-driven consulting firm that helps companies solve business problems and build for the future, with solutions spanning business advisory, customer experience, technology, and analytics. We partner with companies to push the boundaries of what’s possible—together.,Founded in 2001 and headquartered in Seattle, WA, Slalom has organically grown to nearly 4,000 employees. We were named one of Fortune’s 100 Best Companies to Work For in 2016 and are regularly recognized by our employees as a best place to work. You can find us in 25 cities across the U.S., U.K., and Canada.,Delivery Network: One of our fastest-growing capabilities is our Cross-Market Delivery Network, which uses agile engineering to deliver custom-built digital products and solutions. The centers, which are located near local Slalom offices to support clients and teams in the same or adjacent time zones, provide regional remote delivery capabilities at scale. Strategic partners include Salesforce, Amazon Web Services, Microsoft, and Tableau., ,Job Title: Sr. QE Engineer,At Slalom, our Quality Engineering practice is dedicated to maximizing the value and effectiveness of our delivery teams by bringing modern, innovative testing techniques and tools to our solutions and our clients. Our team of experienced quality engineering professionals embrace collaborative, agile testing processes and focus on enabling whole-team ownership of quality.,Slalom is seeking senior candidates for Quality Engineering (QE) Sr. Engineer roles within its rapidly growing Software QE Practice This role requires working with project teams and leadership to define test automation strategy and drive implementation across a variety of Slalom clients. Successful candidates are able to evaluate the latest tools and automation frameworks and extend them appropriately.,Qualified candidates will have a minimum of five years of experience in the Software QE (or related) field, with at least three years building and maintaining test automation frameworks., ,Responsibilities,• Perform all aspects of automated testing for client engagements,• Develop detailed testing approach and plans for specific test areas or overall plans for small to medium size projects,• Produce status reports and quality metrics,• Facilitate defect triage and manage overall defect resolution process,• Conduct test case reviews and ensure requirements traceability, proper coverage,• Design test cases and execute all types of testing (e.g. functional, integration, end-to-end) on all variety of platforms (e.g. mobile, web, portal frameworks),• Assist project teams in determining appropriate quality goals and acceptance criteria,• Mentor junior members of the QE team and perform all responsibilities of the QE Engineer when required, ,Minimum Qualifications,• 2 years of professional coding experience in C#, Java, Javascript or Ruby,• UI Test automation experience (e.g. Selenium, Protractor, Watir),• Experience in all phases of the software and testing lifecycle, inception through deployment,• Strong functional testing background, including defining test strategy, test planning, test case design, and execution,• Project experience using an Agile methodology (e.g. Scrum),• Experience with test management tools (e.g. TestRail, Zephyr),• SQL proficiency,• Mixed experience in various QE-related roles such as:  ,o Software Development Engineer in Test (SDET),o Automation tester or automation framework developer,o Manual functional tester,o Performance test engineer,o Defect manager,o QE tools, reporting, and metrics specialist,o Mobile or web UX tester,o Test environment or test data coordinator/lead, ,Additional Qualifications,• Additional technical experience:,o Unit and integration testing,o Service / API testing,o Performance / load testing,o DevOps / build engineering,o Application security testing,o Custom test tool development,o Mobile application automation,• Project management, Scrum Master,• Business requirements analysis,• Consulting experience, ,Slalom Is An Equal Opportunity Employer And All Qualified Applicants Will Receive Consideration For Employment Without Regard To Race, Color, Religion, Sex, National Origin, Disability Status, Protected Veteran Status, Or Any Other Characteristic Protected By Law.",
        "status": ""
    },
    {
        "company": "BOMBBOMB",
        "job_title": "Web Application Developer",
        "location": "COLORADO SPRINGS",
        "description": "Who we are...,BombBomb makes it easy to use simple videos to build relationships through email, text and social media. Our team is scrappy and intelligent. Competitive and collaborative. Fun-loving and tenacious. We're close-knit and love adding new talent to the mix. Rehumanizing the planet can't be done without EXCELLENT people and we want to add you to our already amazing team!,Who we're looking for...,A Web Application Developer eager to learn and collaborate with those around them who produces quality results with a low frequency of serious defects. The Developer is attentive to the needs of the quality feedback loop, from report to resolution; ability to take ideas and requirements from concept to completion and engage those who are crucial to the project’s success.,What you will do...,How you'll do it...,Embody BombBomb’s core values: Relationships, Fun, Humility, Flexibility and Service,Our ideal candidate will be or have...,BombBomb Benefits Package Includes...",
        "status": ""
    }
]